# Задача 2.1.

# Создайте две функции maximum и minimum,
# которые получают список целых чисел в качестве входных данных
# и возвращают наибольшее и наименьшее число в этом списке соответственно.
# Например,
# * [4,6,2,1,9,63,-134,566]         -> max = 566, min = -134
# * [-52, 56, 30, 29, -54, 0, -110] -> min = -110, max = 56
# * [42, 54, 65, 87, 0]             -> min = 0, max = 87
# * [5]                             -> min = 5, max = 5
# функции sorted, max и min использовать нельзя!

"""ЗАДАЧА 1"""
def minmax(arr):
    imins = imax = arr[0]
    for num in arr:
        if num<imins:
            imins = num
        else:
            if num > imax:
                imax = num
    print ("Минимум - ", imins,"Максимум - ", imax)


print(minmax([4, 6, 2, 1, 9, 63, -134, 566]))
# #
# # # Задача 2.2.
# #
# # # Напишите функцию, которая возвращает номер квартал по номеру месяца
# # # Например:
# # # месяц 2 (февраль) является частью первого квартала;
# # # месяц 6 (июнь) является частью второго квартала;
# # # месяц 11 (ноябрь) является частью четвертого квартала.
# #
# #
"""ЗАДАЧА 2"""

def quarter_of(months):
    months = {1: 'Январь', 2: 'Февраль', 3: 'Март', 4: 'Апрель', 5: 'Май', 6: 'Июнь', 7: 'Июль', 8: 'Август',
          9: 'Сентябрь', 10: 'Октябрь', 11: 'Ноябрь', 12: 'Декабрь'}
    if m <= 3:
        print("Введенный номер месяца -", months[m], ", часть 1 квартала")
    elif (m > 3) & (m <= 6):
        print("Введенный номер месяца -", months[m], ", часть 2 квартала")
    elif (m > 6) & (m <= 9):
        print("Введенный номер месяца -", months[m], ", часть 3 квартала")
    elif (m > 9) & (m <= 12):
        print("Введенный номер месяца -", months[m], ", часть 4 квартала")

pass

m = int(input('Введите номер месяца '))
print(quarter_of(m))

"""ЗАДАЧА 3"""
# # # Задача 2.3.
# #
# # # Напишите функцию, которая принимает цифры от 0 до 9 и возвращает значение прописью.
# # # Например,
# # # switch_it_up(1) -> 'One'
# # # switch_it_up(3) -> 'Three'
# # # switch_it_up(10000) -> None
# # # Использовать условный оператор if-elif-else нельзя!
# #
def switch_it_up(number):
    propis = {1: 'one', 2: 'two', 3: 'three', 4: 'four', 5: 'five', 6: 'six', 7: 'seven', 8: 'eight',
              9: 'nine', 10: 'ten', 11: 'eleven', 12: 'twelwe'}
    print(n, "->", propis[n])
    pass

n = int(input("number  "))
print(switch_it_up(n))


"""ЗАДАЧА 4"""
# #
# # # Пункт A.
# # # Напишите функцию, которая удаляет все восклицательные знаки из заданной строк.
# # # Например,
# # # foo("Hi! Hello!") -> "Hi Hello"
# # # foo("") -> ""
# # # foo("Oh, no!!!") -> "Oh, no"
#
def remove_exclamation_marks(s):
    res_str = s.replace("!","")
    print(res_str)
pass

s = input("введите фразу с восклицательными знаками: ")
print(remove_exclamation_marks(s))
# Пункт B.
# Удалите восклицательный знак из конца строки.
# remove("Hi!") == "Hi"
# remove("Hi!!!") == "Hi!!"
# remove("!Hi") == "!Hi"

def remove_exclamation_marks(s):
    res_str = s[:-1]
    print(res_str)
pass

s = (input("введите фразу с восклицательными знаками: "))
print(remove_exclamation_marks(s))





